# How to find and remove duplicate data?

In [1]:
import pandas as pd

In [2]:
raw_data = {
    "city":["Qingdao","Jilin","Changchun","Tianjin","Hangzhou","Changchun","Qingdao"],
    "rank":[1,2,3,4,5,9,1],
    "new cases":[154,66,63,35,28,0,154],
    "total cases":[542,454,136,109,157,0,542]
}

In [3]:
dataf = pd.DataFrame(raw_data,columns=['city','rank','new cases','total cases'])
dataf

        city  rank  new cases  total cases
0    Qingdao     1        154          542
1      Jilin     2         66          454
2  Changchun     3         63          136
3    Tianjin     4         35          109
4   Hangzhou     5         28          157
5  Changchun     9          0            0
6    Qingdao     1        154          542

# duplicated（）

In [4]:
dataf.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
dataf.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [6]:
dataf.loc[dataf.duplicated(keep='first'),:]

      city  rank  new cases  total cases
6  Qingdao     1        154          542

In [7]:
dataf.loc[dataf.duplicated(keep='last'),:]

      city  rank  new cases  total cases
0  Qingdao     1        154          542

In [8]:
dataf.loc[dataf.duplicated(keep=False),:]

      city  rank  new cases  total cases
0  Qingdao     1        154          542
6  Qingdao     1        154          542

In [9]:
dataf.duplicated(['city'],keep='last')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [10]:
dataf.loc[dataf.duplicated(['city'],keep='last')]

        city  rank  new cases  total cases
0    Qingdao     1        154          542
2  Changchun     3         63          136

In [11]:
dataf.loc[dataf.duplicated(['city'],keep='first'),:]

        city  rank  new cases  total cases
5  Changchun     9          0            0
6    Qingdao     1        154          542

In [12]:
dataf.duplicated(['city','rank'],keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [13]:
dataf.loc[dataf.duplicated(['city','rank'],keep='first')]

      city  rank  new cases  total cases
6  Qingdao     1        154          542

# drop_duplicates()

In [14]:
dataf.drop_duplicates()

        city  rank  new cases  total cases
0    Qingdao     1        154          542
1      Jilin     2         66          454
2  Changchun     3         63          136
3    Tianjin     4         35          109
4   Hangzhou     5         28          157
5  Changchun     9          0            0

In [15]:
newdf = dataf.drop_duplicates(['city'])
newdf

        city  rank  new cases  total cases
0    Qingdao     1        154          542
1      Jilin     2         66          454
2  Changchun     3         63          136
3    Tianjin     4         35          109
4   Hangzhou     5         28          157

In [16]:
dataf.drop_duplicates(['city'],keep='first')

        city  rank  new cases  total cases
0    Qingdao     1        154          542
1      Jilin     2         66          454
2  Changchun     3         63          136
3    Tianjin     4         35          109
4   Hangzhou     5         28          157

In [18]:
dataf.drop_duplicates(['city'],keep='last')

        city  rank  new cases  total cases
1      Jilin     2         66          454
3    Tianjin     4         35          109
4   Hangzhou     5         28          157
5  Changchun     9          0            0
6    Qingdao     1        154          542

In [19]:
dataf.drop_duplicates(['city'],keep=False)

       city  rank  new cases  total cases
1     Jilin     2         66          454
3   Tianjin     4         35          109
4  Hangzhou     5         28          157

In [ ]:
# dataset: adult
df = pd.read_csv("adult.csv")

df.head()

In [ ]:
df.shape

In [ ]:
df.duplicated(subset=['fnlwgt'])

In [ ]:
df.duplicated(subset=['fnlwgt']).sum()

In [ ]:
df.duplicated().sum()

In [ ]:
df.loc[df.duplicated(keep='first'),:]

In [ ]:
df.loc[df.duplicated(keep='last'),:]

In [ ]:
df.drop_duplicates().shape

In [ ]:
df.drop_duplicates(keep=False).shape

In [ ]:
df.drop_duplicates(subset=['age','workclass']).shape

In [ ]:
df.drop_duplicates(subset=['age','sex']).shape

In [ ]:
df.duplicated()

In [ ]:
df.duplicated().sum()

In [ ]:
df['age'].duplicated().sum()

In [ ]:
df['fnlwgt'].shape

In [ ]:
df['fnlwgt'].drop_duplicates().shape

In [ ]:
df['fnlwgt'].isnull().sum()

In [ ]:
df['fnlwgt'].drop_duplicates()